Revit 2027 API
MEPCalculationServerInfo(MEPCalculationServerInfo) Constructor
 Constructs a new copy of the input MEPCalculationServerInfo object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPCalculationServerInfo(
	MEPCalculationServerInfo other
)
Public Sub New (
	other As MEPCalculationServerInfo
)
public:
MEPCalculationServerInfo(
	MEPCalculationServerInfo^ other
)
new :
        other : MEPCalculationServerInfo -> MEPCalculationServerInfo
Parameters
other MEPCalculationServerInfo
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPCalculationServerInfo Class
MEPCalculationServerInfo Overload
Autodesk.Revit.DB Namespace